import java.util.Scanner;

public class building {
    /*Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
•	На всеки четен етаж има само офиси
•	На всеки нечетен етаж има само апартаменти
•	Всеки апартамент се означава по следния начин :
А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
•	Всеки офис се означава по следния начин :
О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
•	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'.
Ако има само един етаж, то има само големи апартаменти!
От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.
*/
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int floors = Integer.parseInt(scanner.nextLine());//брой етажи
        int rooms = Integer.parseInt(scanner.nextLine());//брой стаи на етаж

        //преминаваме през етажите с цикъл
        for (int floor = floors; floor >= 1; floor--) {
            //за всеки етаж трябва да обходим всички стаи
            for (int room = 0; room < rooms ; room++) {//започва от 0-в номер апартамент
                //последен етаж
                if (floor == floors) {
                    System.out.printf("L%d%d ", floor, room);
                }//ако етажът е четен
                else if (floor % 2 == 0) {
                    System.out.printf("O%d%d ", floor, room);
                }//ако етажът е нечетен
                else if (floor % 2 == 1) {
                    System.out.printf("A%d%d ", floor, room);
                }
            }
            System.out.println();//след като обходим всички стаи от етажа, печатаме нов ред преди да преминем на следващ етаж
        }
    }
}
