import java.util.Scanner;

public class SumTwoNumbers {
    /*Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
    На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
    Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.
   ВХОДЪТ се чете от конзолата и се състои от три реда:
•	Първи ред – начало на интервала – цяло число в интервала [1...999]
•	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
•	Трети ред – магическото число – цяло число в интервала [1...10000]
ИЗХОД:
На конзолата трябва да се отпечата един ред, според резултата:
•	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
o	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
•	Ако не е намерена комбинация отговаряща на условието
o	"{броят на всички комбинации} combinations - neither equals {магическото число}"
*/
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int num1 = Integer.parseInt(scanner.nextLine());
        int num2 = Integer.parseInt(scanner.nextLine());
        int magicNum = Integer.parseInt(scanner.nextLine());

        int count = 0;//брояч на комбинациите двойки
        boolean isFound = false;//задаваме си булевата променлива,че няма намерена двойка
//булева променлива, която ползваме като flag, за да прекъснем и двата цикъла
        for (int i = num1; i <= num2; i++) {
            for (int j = num1; j <= num2; j++) {
                count++;
                if (i + j == magicNum) {
                    isFound = true;//когато имаме валидна комбинация, тоест намерили сме двойка
                    System.out.printf("Combination N:%d (%d + %d = %d)", count, i, j, magicNum);
                    break;//прекъсваме вътрешния цикъл
                }
            }
            if (isFound){
                break;//прекъсваме и външния цикъл, ако имаме намерена двойка числа= magicNum
            }
        }//ако не е намерена двойка, извън цикъла печатаме
        if (!isFound) {
            System.out.printf("%d combinations - neither equals %d", count, magicNum);
        }
    }
}
