import java.util.Scanner;

public class TransportPrice {
    public static void main(String[] args) {
        /*n километра с три вида транспорт:
•	Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
•	Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
•	Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
Напишете програма, която въвежда броя километри n и период от деня (ден или нощ) и изчислява цената на най-евтиния транспорт.
ВХОД:
•	Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
•	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
ИЗХОД:
Число-> най-ниската цена за посочения брой километри, форматирана до втория знак след десетичния разделител.
         */
        Scanner scanner = new Scanner(System.in);
        int distance = Integer.parseInt(scanner.nextLine());
        String command = scanner.nextLine();
        double price = 0;

        switch (command) {
            case "day":
                //възможности: само с такси
                if (distance < 20) {
                    price = 0.79 * distance + 0.70;//сумата с вкл. първоначална такса
                }
                //три такси, влак, автобус, но най-евтино е с влак -> 0.06лв/км
                else if (distance >= 100) {
                    price = 0.06 * distance;
                } else {//възможности: такси и автобу, но най-евтино е с автобус -> 0.09лв/лм
                    price = 0.09 * distance;
                }
                break;
            case "night":
                //възможности: само с такси
                if (distance < 20) {
                    price = 0.90 * distance + 0.70;
                }
                //три такси, влак, автобус, но най-евтино е с влак -> 0.06лв/км
                else if (distance >= 100) {
                    price = 0.06 * distance;
                } else {//възможности: такси и автобу, но най-евтино е с автобус -> 0.09лв/лм
                    price = 0.09 * distance;
                }
                  break;

        }
        System.out.printf("%.2f",price);

    }
}





